20220824142217-marginalize_over_discrete_parameters.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-28 Thu 21:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Marginalize over discrete parameters</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Marginalize over discrete parameters</h1>

<div id="outline-container-org9c744d9" class="outline-2">
<h2 id="org9c744d9">Design in <a href="20220824141859-aeppl.html#ID-e18d689a-392a-407a-941a-f0ad2d2dc43e">AePPL</a></h2>
<div class="outline-text-2" id="text-org9c744d9">
<p>
Marginalization is an operation that happens at the level of the <i>probability density</i>. First, we could add a <code>marginalize</code> function that takes a density and a set of values to marginalize out, and rewrites the density to return its marginalized counterpart:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">import</span> aeppl

logprob, (y_vv, i_vv) = aeppl.joint_logprob(Y_rv, i_rv)
<span style="color: #DFAF8F;">marginalized_logprob</span> = aeppl.marginalize(logprob, i_vv)
</pre>
</div>

<p>
Another solution is to add <code>marginalize</code> keyword to <code>joint_logprob</code>:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">import</span> aeppl

logprob, (y_vv,) = aeppl.joint_logprob(Y_rv, i_rv, marginalize=(i_rv,))
</pre>
</div>

<p>
What this keyword hides is a function that acts at the <i>measure</i> level in AePPL's intermediate representation. The availability of this intermediate representation in <code>joint_logprob</code> makes it easier to perform marginalization at this level. The internals of <code>joint_logprob</code> would then look like in pseudo-code:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">joint_logprob</span>(*rvs, *, to_marginalize):
    <span style="color: #DFAF8F;">rvs_to_values</span> = aeppl.internals.create_value_variables(rvs)
    <span style="color: #DFAF8F;">measures</span> = aeppl.internals.to_ir(rvs_to_values)
    <span style="color: #DFAF8F;">marginalized_measures</span> = aeppl.internals.marginalize(measures, to_marginalize)
    <span style="color: #DFAF8F;">logdensity</span> = aeppl.internals.disintegrate(marginalized_measures)
</pre>
</div>

<p>
This makes me think that <a href="20221222092746-aeppl_s_intermediate_representation_should_be_a_first_class_citizen.html#ID-e6355555-c54b-46c1-8dde-d8608bb2a4ba">AePPL's intermediate representation should be a first-class citizen</a>.
</p>
</div>
</div>

<div id="outline-container-orga97828f" class="outline-2">
<h2 id="orga97828f">Related issues</h2>
<div class="outline-text-2" id="text-orga97828f">
<ul class="org-ul">
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/aesara-devs/aeppl/issues/21">https://github.com/aesara-devs/aeppl/issues/21</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf71b1ca" class="outline-2">
<h2 id="orgf71b1ca">Different examples of marginalization</h2>
<div class="outline-text-2" id="text-orgf71b1ca">
</div>
<div id="outline-container-orge57dc68" class="outline-3">
<h3 id="orge57dc68"><span class="todo TODO">TODO</span> Discrete mixtures</h3>
</div>
<div id="outline-container-org49d249b" class="outline-3">
<h3 id="org49d249b">Switchpoint model</h3>
<div class="outline-text-3" id="text-org49d249b">
<p>
Consider the following example from the <a target='_blank' rel='noopener noreferrer' class='external' href="https://mc-stan.org/docs/2_20/stan-users-guide/change-point-section.html">Stan documentation</a>:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">import</span> aesara
<span style="color: #F0DFAF; font-weight: bold;">import</span> aesara.tensor <span style="color: #F0DFAF; font-weight: bold;">as</span> at

<span style="color: #DFAF8F;">srng</span> = at.random.RandomStream(0)

<span style="color: #DFAF8F;">r_e</span> = at.scalar(<span style="color: #CC9393;">'r_e'</span>)
<span style="color: #DFAF8F;">r_l</span> = at.scalar(<span style="color: #CC9393;">'r_l'</span>)
<span style="color: #DFAF8F;">T</span> = at.iscalar(<span style="color: #CC9393;">'T'</span>)

<span style="color: #DFAF8F;">e_rv</span> = srng.exponential(r_e)
<span style="color: #DFAF8F;">l_rv</span> = srng.exponential(r_l)
<span style="color: #DFAF8F;">s_rv</span> = srng.integers(1, T)

<span style="color: #DFAF8F;">t</span> = at.arange(1, T)
<span style="color: #DFAF8F;">rate</span> = at.where(at.ge(s_rv, t), e_rv, l_rv)
<span style="color: #DFAF8F;">D_rv</span> = srng.poisson(rate)

<span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">Draw from the prior predictive distribution</span>
<span style="color: #DFAF8F;">fn</span> = aesara.function([r_e, r_l, T], D_rv)
<span style="color: #F0DFAF; font-weight: bold;">print</span>(fn(1., 3., 10))
</pre>
</div>

<p>
Here we can marginalize over <code>integers</code> to ease sampling, and recover the posterior distribution using posterior predictive sampling.
</p>
</div>
</div>
</div>

<div id="outline-container-org7d640bd" class="outline-2">
<h2 id="org7d640bd">Links to this note</h2>
</div>
</div>
</body>
</html>
